"use strict";

// ==============================================
// console.log("Jacob");
// console.log("value");
// ==============================================

//*1.Виведення привітання:
//*Виведіть рядок "Привіт, світ!" у консоль.

// console.log("Привіт, світ!");
// ==============================================
//*2.Виведення числа:
//*Виведіть число 42 у консоль.

// console.log(42);
// ==============================================

//*3.Виведення змінної:
//*Оголосіть змінну name і присвойте їй ваше ім'я, а потім виведіть це ім'я у консоль.

// const nameMy = "Krystyna";

// console.log(nameMy);
// ==============================================

//*4.Виведення масиву:
//*Оголосіть масив чисел та виведіть його у консоль.

// const arr = [5, 3, 8, 6, 5, 1, 8, 7, 9, 5, 5];

// console.log(arr);
// ==============================================

//*5.Виведення об'єкта:
//*Оголосіть об'єкт з інформацією про вас (ім'я, вік, місце проживання) та виведіть його у консоль.

// const obj = {
//   name: "Krystyna",
//   age: 28,
//   country: "Jordan",
// };

// console.log(obj);
// ==============================================

//*6. **Виведення рядка з форматуванням:**
//*Оголосіть змінні `day`, `month` та `year`, які містять вашу дату народження, і виведіть їх у консоль,
//*використовуючи рядок з форматуванням.

// let day = 30;
// let month = "May";
// let year = 1996;

// console.log(`My Birthday ${day} ${month} ${year}`);
// ==============================================

//*7.Виведення результату операції:
//*Виведіть результат додавання двох чисел.

// let number1 = 24;
// let number2 = 15;

// console.log(number1 + number2);
// console.log(`Summ numbers = ${number1 + number2}`);
// ==============================================

// function foo() {
//   const x = 10;
//   const y = 15;
//   debugger;
//   const array = () => {
//     console.log(x + y);
//   };

//   array();
// }

// foo();
// ==============================================
// const message = "JavaScript is awesome!";
// alert(message);
// ==============================================

// Просимо клієнта підтвердити бронювання готелю
// і зберігаємо результат роботи confirm у змінну
// const isComing = confirm("Please confirm hotel reservation");
// console.log(isComing);

// ==============================================

// Запитуємо назву готеля, в якому хотів би зупинитися клієнт
// і зберігаємо результат виклику prompt у змінну.
// const hotelName = prompt("Please enter desired hotel name");
// console.log(hotelName);

// ==============================================

// const value = prompt("Please enter a number!");
// console.log(typeof value); // "string"
// console.log(value); // "5"

// ==============================================

// const x = 5;
// const y = 10;
// const z = 5;

// console.log("x > y:", x > y); // false
// console.log("x < y:", x < y); // true
// console.log("x < z:", x < z); // false
// console.log("x <= z:", x <= z); // true
// console.log("x === y:", x === y); // false
// console.log("x === z:", x === z); // true
// console.log("x !== y:", x !== y); // true
// console.log("x !== z:", x !== z); // false

// ==============================================

// const num1 = "Hi 24";
// console.log(Number(num1)); //NaN
// ==============================================

// console.log(Number.parseInt("5px")); // 5
// console.log(Number.parseInt("12qwe74")); // 12
// console.log(Number.parseInt("12.46qwe79")); // 12
// console.log(Number.parseInt("qweqwe")); // NaN

// ==============================================

// console.log(Number.parseFloat("5px")); // 5
// console.log(Number.parseFloat("12qwe74")); // 12
// console.log(Number.parseFloat("12.46qwe79")); // 12.46
// console.log(Number.parseFloat("qweqwe")); // NaN

// ==============================================

// const validNumber = Number("51"); // 51
// console.log(Number.isNaN(validNumber)); // false

// const invalidNumber = Number("qweqwe"); // NaN
// console.log(Number.isNaN(invalidNumber)); // true

// ==============================================

// const validNumber = Number("51"); // 51

// console.log(typeof validNumber); //number

// ==============================================

// console.log(Math.random()); // випадкове число між 0 і 1
// console.log(Math.random() * (10 - 1) + 1); // псевдовипадкове число від 1 до 10
// ==============================================

// const pricePerDroid = 800;
// const orderedQuantity = 6;
// const deliveryFee = 50;
// const totalPrice = pricePerDroid * orderedQuantity + deliveryFee;
// const message = `You ordered droids worth ${totalPrice} credits`;

// console.log(totalPrice);
// console.log(message);
// ==============================================

// const courseTopic = "JavaScript essentials";

// const courseTopicLength = courseTopic.length;
// const firstElement = courseTopic[0];
// const lastElement = courseTopic[courseTopic.length - 1];

// console.log(courseTopicLength);
// console.log(firstElement);
// console.log(lastElement);
// ==============================================
// console.log(typeof 5);
// console.log(typeof "5");
// ==============================================

// function toDoHomework() {
//   console.log("I'm doing homework right now.");
// }

/* toDoHomework(); */
// ==============================================

// function multiply(x, y, z) {
//   console.log("The code before return is executed as usual");

//   return x * y * z;

//   console.log("This code is never executed because it is after return");
// }

// console.log(multiply(2, 3, 5)); // 30

// ==============================================

// function multiply(x, y, z) {
//   console.log(`Result: ${x * y * z}`);
// }

// console.log("Log before multiply execution");
// multiply(2, 3, 5); // "Result: 30"
// console.log("Log after multiply execution");

// ==============================================

// function makeMessage(username) {
//   console.log(`Hello ${username}`);
// }

// makeMessage("Jacob");

// ==============================================

// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
// ==============================================
